app/views/welcome/index.html.erb

			<div class="box-header" data-original-title>
				<h2><i class="icon-user"></i><span class="break"></span><%= Property.all.size %> office spaces for rent </h2>
---
SELECT COUNT(*) FROM `properties`