app/controllers/welcome_controller.rb

  def index
    @user = current_user
    if params[:search].present?
      params[:search][:min_sqrt]||= ""
      params[:search][:max_sqrt]||= ""
      params[:search][:min_price]||= ""
      params[:search][:max_price]||= ""
      params[:search][:to_do]||= ""
      @properties = Property.search_data(params[:search])
    else
      @properties = Property.all.paginate(:page => params[:page], :per_page => 10)
---
SELECT COUNT(*) FROM `properties`
SELECT `properties`.* FROM `properties` LIMIT 10 OFFSET 0